<?php

	//половая принадлежность
	function gender_array() {
		return array (
			"0" => "Нету",
			"1" => "Мужской",
			"2" => "Женский"
		);
	}

	//Список областей
	function region_array() {
	return array (
		"22" => "Алтайский край",		"28" => "Амурская область",					"29" => "Архангельская область",				"30" => "Астраханская область",
		"31" => "Белгородская область",	"32" => "Брянская область",					"33" => "Владимирская область",					"34" => "Волгоградская область",
		"35" => "Вологодская область",	"36" => "Воронежская область",				"77" => "Город Москва",							"78" => "Город Санкт-Петербург",
		"92" => "Город Севастополь",	"79" => "Еврейская автономная область",		"75" => "Забайкальский край",					"37" => "Ивановская область",
		"38" => "Иркутская область",	"07" => "Кабардино-Балкарская Республика",	"39" => "Калининградская область",				"40" => "Калужская область",
		"41" => "Камчатский край",		"09" => "Карачаево-Черкесская Республика",	"42" => "Кемеровская область",					"43" => "Кировская область",
		"44" => "Костромская область",	"23" => "Краснодарский край",				"24" => "Красноярский край",					"45" => "Курганская область",
		"46" => "Курская область",		"47" => "Ленинградская область",			"48" => "Липецкая область",						"49" => "Магаданская область",
		"50" => "Московская область",	"51" => "Мурманская область",				"83" => "Ненецкий автономный округ",			"52" => "Нижегородская область",
		"53" => "Новгородская область",	"54" => "Новосибирская область",			"55" => "Омская область",						"56" => "Оренбургская область",
		"57" => "Орловская область",	"58" => "Пензенская область",				"59" => "Пермский край",						"25" => "Приморский край",
		"60" => "Псковская область",	"01" => "Республика Адыгея",				"02" => "Республика Алтай",						"03" => "Республика Башкортостан",
		"04" => "Республика Бурятия",	"05" => "Республика Дагестан",				"06" => "Республика Ингушетия",					"08" => "Республика Калмыкия",
		"10" => "Республика Карелия",	"11" => "Республика Коми",					"91" => "Республика Крым",						"12" => "Республика Марий Эл",
		"13" => "Республика Мордовия",	"14" => "Республика Саха (Якутия)",			"15" => "Республика Северная Осетия-Алания",	"16" => "Республика Татарстан",
		"17" => "Республика Тыва",		"19" => "Республика Хакасия",				"61" => "Ростовская область",					"62" => "Рязанская область",
		"63" => "Самарская область",	"64" => "Саратовская область",				"65" => "Сахалинская область",					"66" => "Свердловская область",
		"67" => "Смоленская область",	"26" => "Ставропольский край",				"68" => "Тамбовская область",					"69" => "Тверская область",
		"70" => "Томская область",		"71" => "Тульская область",					"72" => "Тюменская область",					"18" => "Удмуртская Республика",
		"73" => "Ульяновская область",	"27" => "Хабаровский край",					"86" => "Ханты-Мансийский автономный округ - Югра (Тюменская область)",
		"74" => "Челябинская область",	"20" => "Чеченская Республика",				"21" => "Чувашская Республика - Чувашия",		"87" => "Чукотский автономный округ",
		"89" => "Ямало-Ненецкий автономный округ",									"76" => "Ярославская область",					"95" => "Территории за пределами РФ"
		);
	}

	//Список должностей
	function prof_array() {
	return array(
			"1" => "Председатель",  "2" => "Заместитель председателя",  "3" => "Судья",
			//Должности категории "руководители" | Ведущая группа должностей
			"4" => "Начальник отдела",  "5" => "Заместитель начальника отдела",
			//Должности категории "помощники (советники)" | Ведущая группа должностей
			"6" => "Помощник председателя суда",    "7" => "Помощник судьи",
			//Должности категории "специалисты" | Старшая группа должностей
			"8" => "Консультант",           "9" => "Секретарь судебного заседания", "10" => "Главный специалист",
			"11" => "Ведущий специалист",   "12" => "Секретарь суда",               "13" => "Специалист",
			//Должности категории "обеспечивающие специалисты" Старшая группа должностей
			"14" => "Старший специалист 1 разряда", "15" => "Старший специалист 2 разряда", "16" => "Старший специалист 3 разряда",
			//Младшая группа должностей
			"17" => "Специалист 1 разряда", "18" => "Специалист 2 разряда", "19" => "Специалист 3 разряда",
			//Иные
			"20" => "Администратор",
			"21" => "Рабочий, 1 разряд",
			"22" => "Рабочий, 2 разряд",
			"23" => "Рабочий, 3 разряд"
		);
	}

	//Группы пользователей
	function primary_group_array() {
	return array(
			"judges" => array("id" => 1, "name" => "Судьи"),
			"assistants" => array("id" => 2, "name" => "Помощники судей"),
			"secretary" => array("id" => 3, "name" => "Секретари судебного заседания"),
			"chancery" => array("id" => 4, "name" => "Канцелярия")
		);
	}